IDENTIFICATION DIVISION.
PROGRAM-ID. DLI-STUB.

DATA DIVISION.
LINKAGE SECTION.
01 LK-SEGMENT PIC X(10).

PROCEDURE DIVISION USING LK-SEGMENT.
    MOVE 'RETAIL' TO LK-SEGMENT
    GOBACK.
